modules/xunyou/files/fail2ban/shell/serviceforweb20001.xml

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions name="ServiceForWeb" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <wsdl:types>
    <xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:import namespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/>
      <xs:element name="GetData">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="value" type="xs:int"/>
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="GetDataResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="GetDataResult" nillable="true" type="xs:string"/>
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="Execute">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="command" nillable="true" type="xs:string"/>
            <xs:element minOccurs="0" name="userid" type="xs:int"/>
            <xs:element minOccurs="0" name="requestParameters" nillable="true" type="q1:ArrayOfKeyValueOfstringstring" xmlns:q1="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/>
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="ExecuteResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="ExecuteResult" nillable="true" type="xs:string"/>
            <xs:element minOccurs="0" name="responseResult" nillable="true" type="q2:ArrayOfKeyValueOfstringstring" xmlns:q2="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/>
            <xs:element minOccurs="0" name="list" nillable="true" type="xs:string"/>
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="Execute_New">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="command" nillable="true" type="xs:string"/>
            <xs:element minOccurs="0" name="userid" type="xs:int"/>
            <xs:element minOccurs="0" name="requestParameters" nillable="true" type="q3:ArrayOfKeyValueOfstringstring" xmlns:q3="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/>
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="Execute_NewResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="Execute_NewResult" nillable="true" type="xs:string"/>
            <xs:element minOccurs="0" name="responseResult" nillable="true" type="q4:ArrayOfKeyValueOfstringstring" xmlns:q4="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/>
            <xs:element minOccurs="0" name="list" nillable="true">
              <xs:complexType>
                <xs:annotation>
                  <xs:appinfo>
                    <ActualType Name="DataSet" Namespace="http://schemas.datacontract.org/2004/07/System.Data" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/>
                  </xs:appinfo>
                </xs:annotation>
                <xs:sequence>
                  <xs:element ref="xs:schema"/>
                  <xs:any/>
                </xs:sequence>
              </xs:complexType>
            </xs:element>
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="SendMessage">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="command" nillable="true" type="xs:string"/>
            <xs:element minOccurs="0" name="userid" type="xs:int"/>
            <xs:element minOccurs="0" name="requestParameters" nillable="true" type="q3:ArrayOfKeyValueOfstringstring" xmlns:q3="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/>
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="SendMessageResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="SendMessageResult" nillable="true" type="xs:string"/>
            <xs:element minOccurs="0" name="responseResult" nillable="true" type="q4:ArrayOfKeyValueOfstringstring" xmlns:q4="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/>
            <xs:element minOccurs="0" name="list" nillable="true" type="xs:string"/>
          </xs:sequence>
        </xs:complexType>
      </xs:element>
    </xs:schema>
    <xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/">
      <xs:element name="anyType" nillable="true" type="xs:anyType"/>
      <xs:element name="anyURI" nillable="true" type="xs:anyURI"/>
      <xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/>
      <xs:element name="boolean" nillable="true" type="xs:boolean"/>
      <xs:element name="byte" nillable="true" type="xs:byte"/>
      <xs:element name="dateTime" nillable="true" type="xs:dateTime"/>
      <xs:element name="decimal" nillable="true" type="xs:decimal"/>
      <xs:element name="double" nillable="true" type="xs:double"/>
      <xs:element name="float" nillable="true" type="xs:float"/>
      <xs:element name="int" nillable="true" type="xs:int"/>
      <xs:element name="long" nillable="true" type="xs:long"/>
      <xs:element name="QName" nillable="true" type="xs:QName"/>
      <xs:element name="short" nillable="true" type="xs:short"/>
      <xs:element name="string" nillable="true" type="xs:string"/>
      <xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/>
      <xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/>
      <xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/>
      <xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/>
      <xs:element name="char" nillable="true" type="tns:char"/>
      <xs:simpleType name="char">
        <xs:restriction base="xs:int"/>
      </xs:simpleType>
      <xs:element name="duration" nillable="true" type="tns:duration"/>
      <xs:simpleType name="duration">
        <xs:restriction base="xs:duration">
          <xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/>
          <xs:minInclusive value="-P10675199DT2H48M5.4775808S"/>
          <xs:maxInclusive value="P10675199DT2H48M5.4775807S"/>
        </xs:restriction>
      </xs:simpleType>
      <xs:element name="guid" nillable="true" type="tns:guid"/>
      <xs:simpleType name="guid">
        <xs:restriction base="xs:string">
          <xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/>
        </xs:restriction>
      </xs:simpleType>
      <xs:attribute name="FactoryType" type="xs:QName"/>
      <xs:attribute name="Id" type="xs:ID"/>
      <xs:attribute name="Ref" type="xs:IDREF"/>
    </xs:schema>
    <xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
      <xs:complexType name="ArrayOfKeyValueOfstringstring">
        <xs:annotation>
          <xs:appinfo>
            <IsDictionary xmlns="http://schemas.microsoft.com/2003/10/Serialization/">true</IsDictionary>
          </xs:appinfo>
        </xs:annotation>
        <xs:sequence>
          <xs:element minOccurs="0" maxOccurs="unbounded" name="KeyValueOfstringstring">
            <xs:complexType>
              <xs:sequence>
                <xs:element name="Key" nillable="true" type="xs:string"/>
                <xs:element name="Value" nillable="true" type="xs:string"/>
              </xs:sequence>
            </xs:complexType>
          </xs:element>
        </xs:sequence>
      </xs:complexType>
      <xs:element name="ArrayOfKeyValueOfstringstring" nillable="true" type="tns:ArrayOfKeyValueOfstringstring"/>
    </xs:schema>
    <xs:schema elementFormDefault="qualified" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:element name="DataSet" nillable="true">
        <xs:complexType>
          <xs:annotation>
            <xs:appinfo>
              <ActualType Name="DataSet" Namespace="http://schemas.datacontract.org/2004/07/System.Data" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/>
            </xs:appinfo>
          </xs:annotation>
          <xs:sequence>
            <xs:element ref="xs:schema"/>
            <xs:any/>
          </xs:sequence>
        </xs:complexType>
      </xs:element>
    </xs:schema>
  </wsdl:types>
  <wsdl:message name="IServiceForWeb_GetData_InputMessage">
    <wsdl:part name="parameters" element="tns:GetData"/>
  </wsdl:message>
  <wsdl:message name="IServiceForWeb_GetData_OutputMessage">
    <wsdl:part name="parameters" element="tns:GetDataResponse"/>
  </wsdl:message>
  <wsdl:message name="IServiceForWeb_Execute_InputMessage">
    <wsdl:part name="parameters" element="tns:Execute"/>
  </wsdl:message>
  <wsdl:message name="IServiceForWeb_Execute_OutputMessage">
    <wsdl:part name="parameters" element="tns:ExecuteResponse"/>
  </wsdl:message>
  <wsdl:message name="IServiceForWeb_Execute_New_InputMessage">
    <wsdl:part name="parameters" element="tns:Execute_New"/>
  </wsdl:message>
  <wsdl:message name="IServiceForWeb_Execute_New_OutputMessage">
    <wsdl:part name="parameters" element="tns:Execute_NewResponse"/>
  </wsdl:message>
  <wsdl:portType name="IServiceForWeb">
    <wsdl:operation name="GetData">
      <wsdl:input wsaw:Action="http://tempuri.org/IServiceForWeb/GetData" message="tns:IServiceForWeb_GetData_InputMessage"/>
      <wsdl:output wsaw:Action="http://tempuri.org/IServiceForWeb/GetDataResponse" message="tns:IServiceForWeb_GetData_OutputMessage"/>
    </wsdl:operation>
    <wsdl:operation name="Execute">
      <wsdl:input wsaw:Action="http://tempuri.org/IServiceForWeb/Execute" message="tns:IServiceForWeb_Execute_InputMessage"/>
      <wsdl:output wsaw:Action="http://tempuri.org/IServiceForWeb/ExecuteResponse" message="tns:IServiceForWeb_Execute_OutputMessage"/>
    </wsdl:operation>
    <wsdl:operation name="Execute_New">
      <wsdl:input wsaw:Action="http://tempuri.org/IServiceForWeb/Execute_New" message="tns:IServiceForWeb_Execute_New_InputMessage"/>
      <wsdl:output wsaw:Action="http://tempuri.org/IServiceForWeb/Execute_NewResponse" message="tns:IServiceForWeb_Execute_New_OutputMessage"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="BasicHttpBinding_IServiceForWeb" type="tns:IServiceForWeb">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="GetData">
      <soap:operation soapAction="http://tempuri.org/IServiceForWeb/GetData" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="Execute">
      <soap:operation soapAction="http://tempuri.org/IServiceForWeb/Execute" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="Execute_New">
      <soap:operation soapAction="http://tempuri.org/IServiceForWeb/Execute_New" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="ServiceForWeb">
    <wsdl:port name="BasicHttpBinding_IServiceForWeb" binding="tns:BasicHttpBinding_IServiceForWeb">
      <soap:address location="http://59.151.39.228:20001/serviceforweb.svc"/>
    </wsdl:port>
  </wsdl:service>
  <wsdl:message name="IReceiver_SendMessage_InputMessage">
    <wsdl:part name="parameters" element="tns:SendMessage"/>
  </wsdl:message>
  <wsdl:message name="IReceiver_SendMessage_OutputMessage">
    <wsdl:part name="parameters" element="tns:SendMessageResponse"/>
  </wsdl:message>
  <wsdl:portType name="IReceiver">
    <wsdl:operation name="SendMessage">
      <wsdl:input wsaw:Action="http://tempuri.org/IReceiver/SendMessage" message="tns:IReceiver_SendMessage_InputMessage"/>
      <wsdl:output wsaw:Action="http://tempuri.org/IReceiver/SendMessageResponse" message="tns:IReceiver_SendMessage_OutputMessage"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="BasicHttpBinding_IReceiver" type="tns:IReceiver">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="SendMessage">
      <soap:operation soapAction="http://tempuri.org/IReceiver/SendMessage" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="Receiver">
    <wsdl:port name="BasicHttpBinding_IReceiver" binding="tns:BasicHttpBinding_IReceiver">
      <soap:address location="http://59.151.39.228:20001/serviceforweb.svc"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>